prototypage/00_prerequis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-08 dim. 18:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prototypage</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="remi.griot@efrei.fr" />
<meta name="description" content="prototypage rapide"
 />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Prototypage</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd38d20c">Bienvenue</a></li>
<li><a href="#org8f3856c">Contenu</a>
<ul>
<li><a href="#orga3122d1">Compétences</a></li>
<li><a href="#org58f7b27">Evaluation</a></li>
<li><a href="#orgce29b0b">Projet</a></li>
<li><a href="#orga233c10">Agenda</a></li>
</ul>
</li>
<li><a href="#org209b9fa">Logiciels prérequis</a>
<ul>
<li><a href="#org1b328b3">Conception 3D - Solidworks</a></li>
<li><a href="#orga41219d">Fabrication 3D</a></li>
<li><a href="#org0328e91">Conception 2D</a></li>
<li><a href="#orgd07d951">Programmation microcontroller</a></li>
<li><a href="#org1a82c92">Gestion de version (optionnel)</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgd38d20c" class="outline-2">
<h2 id="orgd38d20c">Bienvenue</h2>
<div class="outline-text-2" id="text-orgd38d20c">
<p>
Ce cours sur le prototypage se base sur la fabrication numérique, et donc sur toute une suite de logiciel permettant de concevoir, simuler, et enfin fabriquer.
Avant le début du cours, il est vivement conseillé de:
</p>
<ul class="org-ul">
<li>Créer les comptes associés</li>
<li>Installer les logiciels prérequis</li>
</ul>
</div>
</div>

<div id="outline-container-org8f3856c" class="outline-2">
<h2 id="org8f3856c">Contenu</h2>
<div class="outline-text-2" id="text-org8f3856c">
<p>
Ce cours contient plusieurs composantes:
</p>
<ul class="org-ul">
<li>une partie théorique définissant quelques notions essentielles et abordant des questions de méthodologie. Cette partie permet egalement de faire un retour d'expérience.</li>
<li>des exercices permettant de prendre en main les diffférents logiciels. Cette partie se fait en relative autonomie et les corrections sont fournies.</li>
<li>un projet réalisé en binome permettant de mettre en pratique les compétences acquises. Cette partie se fait egalement en relative autonomie.</li>
</ul>

<p>
<a href="./01_intro.html">Introduction</a> <br />
<a href="./02_CAO.html">Conception 3D</a> <br />
</p>
</div>



<div id="outline-container-orga3122d1" class="outline-3">
<h3 id="orga3122d1">Compétences</h3>
<div class="outline-text-3" id="text-orga3122d1">
<p>
Ce cours doit (normalement) vous permettre de monter en compétences sur ces domaines:
</p>
<ul class="org-ul">
<li>Modélisation 2D-3D</li>
<li>Fabrication numérique additive et soustractive</li>
<li>Electronique et programmation</li>
</ul>
</div>
</div>

<div id="outline-container-org58f7b27" class="outline-3">
<h3 id="org58f7b27">Evaluation</h3>
<div class="outline-text-3" id="text-org58f7b27">
<p>
L'évaluation porte principalement sur la qualité du prototype réalisé pendant le projet.
</p>
</div>
</div>

<div id="outline-container-orgce29b0b" class="outline-3">
<h3 id="orgce29b0b">Projet</h3>
<div class="outline-text-3" id="text-orgce29b0b">
<p>
Le projet consiste en la conception, la fabrication et la programmation d'une <i>useless box</i>.
Ce projet implique:
</p>
<ul class="org-ul">
<li>la programmation d'un micro controller</li>
<li>son interfaçage avec un moteur et un switch</li>
<li>la conception des éléments mécaniques et du boitier</li>
</ul>

<p>
<a href="https://youtu.be/rFJcrQHw1k0">https://youtu.be/rFJcrQHw1k0</a>
</p>
</div>
</div>



<div id="outline-container-orga233c10" class="outline-3">
<h3 id="orga233c10">Agenda</h3>
<div class="outline-text-3" id="text-orga233c10">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Lundi (premier jour)</th>
<th scope="col" class="org-left">Mardi</th>
<th scope="col" class="org-left">Mercredi</th>
<th scope="col" class="org-left">Jeudi</th>
<th scope="col" class="org-left">Vendredi</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">AM</td>
<td class="org-left">Introduction      Formation Binome</td>
<td class="org-left">Electronique</td>
<td class="org-left">Fabrication 2D</td>
<td class="org-left">Projet</td>
<td class="org-left">Projet</td>
</tr>

<tr>
<td class="org-left">PM</td>
<td class="org-left">Conception 2D/3D - Exercices</td>
<td class="org-left">Conception 2D/3D     Presentation projet</td>
<td class="org-left">Fabrication 3D</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Evaluation Projet</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>





<div id="outline-container-org209b9fa" class="outline-2">
<h2 id="org209b9fa">Logiciels prérequis</h2>
<div class="outline-text-2" id="text-org209b9fa">
</div>
<div id="outline-container-org1b328b3" class="outline-3">
<h3 id="org1b328b3">Conception 3D - Solidworks</h3>
<div class="outline-text-3" id="text-org1b328b3">
<p>
Voici la procédure pour installer la version étudiante de Solidworks (SDK 2022-2023).
Désinstaller tous les SOLIDWORKS avant d’installer une nouvelle version.
Pour accéder à la page de téléchargement :
</p>

<p>
1 – <a href="https://www.solidworks.com/SDK">https://www.solidworks.com/SDK</a>
Attention, il sera nécessaire de télécharger le hotfix, après installation du logiciel, voir le message en haut de page avant d’indiquer votre nom et adresse mail.<br />
2 – Cliquez sur OUI (question « J’ai déjà un numéro de série »)<br />
4 – Choisissez la version 2022-2023<br />
5 – Numéro de série Solidworks SDK 2022 : 90200054428870073GXSVZBC<br />
6- Télécharger le fichier exécutable.<br />
7- Exécuter le fichier, le « SLDIM » se lance et faites un téléchargement complet tous les fichiers<br />
8- Lancer l’installation une fois que vous avez tous les fichiers sur votre poste à partir de setup.exe<br />
Si vous n’activez pas la licence, vous n’aurez qu’une licence de 30 jours.  Cette licence expirera 365 jours après la date d’activation ou le 31 juillet 2024, selon la première éventualité.
</p>
</div>
</div>

<div id="outline-container-orga41219d" class="outline-3">
<h3 id="orga41219d">Fabrication 3D</h3>
<div class="outline-text-3" id="text-orga41219d">
<p>
Slicer: logiciel permettant de générer le fichier nécessaire à l'impression 3D. Nous utiliserons le slicer compatible avec les imprimantes de l'innovation Lab.
<a href="https://www.raise3d.com/ideamaker/">https://www.raise3d.com/ideamaker/</a>
</p>
</div>
</div>

<div id="outline-container-org0328e91" class="outline-3">
<h3 id="org0328e91">Conception 2D</h3>
<div class="outline-text-3" id="text-org0328e91">
<p>
Solidworks permet de faire de la conception en 2D, mais il egalement interessant d'utiliser un logiciel de dessin vectoriel:
<a href="https://inkscape.org/fr/">https://inkscape.org/fr/</a>
</p>
</div>
</div>

<div id="outline-container-orgd07d951" class="outline-3">
<h3 id="orgd07d951">Programmation microcontroller</h3>
<div class="outline-text-3" id="text-orgd07d951">
<p>
Le compilateur est 100% en ligne mais requiert de créer un compte
<a href="https://studio.keil.arm.com/auth/login/">https://studio.keil.arm.com/auth/login/</a>
</p>
</div>
</div>

<div id="outline-container-org1a82c92" class="outline-3">
<h3 id="org1a82c92">Gestion de version (optionnel)</h3>
<div class="outline-text-3" id="text-org1a82c92">
<p>
Le temps étant limiter, la gestion de version ne sera malheuresement pas aborder dans ce cours.
Si vous voulez en savoir plus <a href="./git.html">Gestion de version</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: remi.griot@efrei.fr</p>
<p class="date">Created: 2023-01-08 dim. 18:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
